In [1]:
import pandas as pd

In [ ]:

df = pd.read_csv('data/train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:


df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [ ]:


df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [ ]:


df.groupby(['Pclass', 'Sex'])['Survived'].mean()

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

In [ ]:

df.groupby('Survived')['Age'].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [ ]:

df['AgeCategory'] = pd.cut(df['Age'], bins=[0, 18, 100], labels=['Child', 'Adult'], right=False)

In [ ]:


df.groupby('AgeCategory', observed=True)['Survived'].mean()

AgeCategory
Child    0.539823
Adult    0.381032
Name: Survived, dtype: float64

In [ ]:



df.groupby(['Pclass', 'Sex', 'AgeCategory'], observed=True)['Survived'].mean().unstack()

AgeCategory       Child     Adult
Pclass Sex
1      female  0.875000  0.974026
       male    1.000000  0.371134
2      female  1.000000  0.903226
       male    0.818182  0.068182
3      female  0.542857  0.417910
       male    0.232558  0.133333

In [ ]:

ortalama_yas = df['Age'].mean()


df['Age'] = df['Age'].fillna(ortalama_yas)


print("Kalan boş 'Age' sayısı:", df['Age'].isnull().sum())

Kalan boş 'Age' sayısı: 0

In [ ]:

df['Sex_numeric'] = df['Sex'].map({'female': 1, 'male': 0})


df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeCategory,Sex_numeric
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adult,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult,0

In [ ]:

features = ['Pclass', 'Age', 'Sex_numeric']


X = df[features]
y = df['Survived']


print("--- Kâhinin bakacağı veriler (X) ---")
print(X.head())
print("\n--- Kâhinin tahmin edeceği cevaplar (y) ---")
print(y.head())

--- Kâhinin bakacağı veriler (X) ---
   Pclass   Age  Sex_numeric
0       3  22.0            0
1       1  38.0            1
2       3  26.0            1
3       1  35.0            1
4       3  35.0            0

--- Kâhinin tahmin edeceği cevaplar (y) ---
0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [ ]:
from sklearn.tree import DecisionTreeClassifier


model = DecisionTreeClassifier(random_state=1)

In [ ]:

model.fit(X, y)

print("KÂHİN EĞİTİLDİ!")
print("Model, Titanic'teki 'kimin kurtulduğu' örüntüsünü öğrendi.")

KÂHİN EĞİTİLDİ!
Model, Titanic'teki 'kimin kurtulduğu' örüntüsünü öğrendi.

In [ ]:

predictions = model.predict(X)


from sklearn.metrics import accuracy_score

accuracy = accuracy_score(y, predictions)

print("--- MODEL BAŞARI RAPORU ---")
print(f"Modelimizin 'train.csv' üzerindeki başarı oranı (Accuracy): {accuracy * 100:.2f}%")

--- MODEL BAŞARI RAPORU ---
Modelimizin 'train.csv' üzerindeki başarı oranı (Accuracy): 87.99%

In [ ]:

test_df = pd.read_csv('data/test.csv')

test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:

test_df['Age'] = test_df['Age'].fillna(ortalama_yas)


test_df['Sex_numeric'] = test_df['Sex'].map({'female': 1, 'male': 0})

print("Test verisi Kâhin'in anlayacağı dile çevrildi.")
test_df.head()

Test verisi Kâhin'in anlayacağı dile çevrildi.

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_numeric
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [ ]:

X_test = test_df[features]


test_predictions = model.predict(X_test)


print("--- TAHMİN SONUÇLARI (İLK 20 YOLCU) ---")
print(test_predictions[:20])

--- TAHMİN SONUÇLARI (İLK 20 YOLCU) ---
[0 0 1 1 1 0 0 0 0 0 0 0 1 1 1 1 0 0 1 0]

In [ ]:

submission = pd.DataFrame({
    "PassengerId": test_df["PassengerId"],
    "Survived": test_predictions
})


submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         1
3          895         1
4          896         1

In [ ]:

submission.to_csv('titanic_submission.csv', index=False)

print("--- BAŞARILI! ---")
print("Tahmin raporunuz 'titanic_submission.csv' adıyla klasörünüze kaydedildi.")

--- BAŞARILI! ---
Tahmin raporunuz 'titanic_submission.csv' adıyla klasörünüze kaydedildi.